TOKEN = '6889532869:AAFLgNYY4GT3NFB9smPV9KpXjVJuyW4rPkE'
ADD = 'add'
ADD_TEXT = 'Добавить ➕'
ADD_CANCEL_TEXT = 'Вернуться назад 🔙'

LIST = 'list'
LIST_TEXT = 'Посмотреть список 🗒'

REMOVE = 'remove'
REMOVE_TEXT = 'Удалить ➖'

REMOVE_CHECKED = 'remove_checked'
REMOVE_CHECKED_TEXT = 'Удалить отмеченное ➖'

REMOVE_ALL = 'remove_all'
REMOVE_ALL_TEXT = 'Удалить всё ❌'

BACK = 'back'
BACK_TEXT = 'Назад 🔙'

HELP = 'help'
HELP_TEXT = 'Помощь ❓'

HTTP = 'http'

HELP_MESSAGE = '''
·Чтобы добавить что-то, напишите сообщение в виде:
'<наименование 1> <URL 1>, <наименование 2> <URL 2>' (URL необязателен);
·Чтобы удалить что-то, выберите это в списке пункта 'Удалить', затем нажмите 'Удалить отмеченное';
·Чтобы удалить все сразу, нажмите 'Удалить все' в пункте 'Удалить';
·Чтобы поменять приоритет закупки, нажмите на ее название в общем списке.
'''

menu = {ADD: ADD_TEXT, LIST: LIST_TEXT, REMOVE: REMOVE_TEXT, HELP: HELP_TEXT}