menu_keys = {
    'add': 'Добавить товар 📝',
    'list': 'Посмотреть список 🗒',
    'remove': 'Удаление 🗑',
    'help': 'Помощь 🆘'}

BACK_CB = 'back'
BACK_TXT = 'Назад ⬅️'

ADD_CB = 'add'
LIST_CB = 'list'
REMOVE_CB = 'remove'
HELP_CB = 'help'
REMOVE_CHECKED_CB = 'remove_checked'
REMOVE_ALL_CB = 'remove_all'

ITEM_CB = 'item_'
CHECKED_CB = 'checked_'
NOTCHECKED_CB = 'notchecked_'

REMOVE_CHECKED_TEXT = 'Удалить выделенное'
REMOVE_ALL_TEXT = 'Удалить все'

MENU = 'Меню'

HTTP = 'http'

ADD_TEXT = 'Добавляем-с\n'
LIST_TEXT = 'Список покупок'
REMOVE_TEXT = 'Нажмите на то, что хотите удалить'
HELP_TEXT = '''
·Чтобы добавить что-то, напишите сообщение в виде:
'<наименование 1> <URL 1>, <наименование 2> <URL 2>' (URL необязателен);
Или очередной товар в новом сообщении;
·Чтобы завершить добавление, нажмите 'Назад';
·Чтобы удалить что-то, выберите это в списке пункта 'Удалить', затем нажмите 'Удалить отмеченное';
·Чтобы удалить все сразу, нажмите 'Удалить все' в пункте 'Удалить';
·Чтобы поменять приоритет закупки, нажмите на ее название в общем списке.
'''

EMOJIS = [
    '👍', '❤', '🔥', '🥰', '👏',
    '😁', '🤔', '🤯', '😱', '🎉',
    '🤩', '🤮', '💩', '🙏', '👌',
    '🤡', '🥱', '🥴', '😍', '🌚',
    '🌭', '💯', '🤣', '🍌', '💔',
    '🤨', '😐', '🍓', '🍾', '🖕',
    '😈', '😴', '😭', '🤓', '👀',
    '🙈', '😇', '😨', '🤝', '✍',
    '🤗', '🫡', '🤪', '🗿', '🆒',
    '😘', '💊', '🙊', '😎', '😡',
]
