menu_keys = {
    'add': 'Добавить товар 📝',
    'list': 'Посмотреть список 🗒',
    'remove': 'Удаление 🗑',
    'help': 'Помощь 🆘'}

BACK_CB = 'back'
BACK_TXT = 'Назад ⬅️'

BACK_TO_LIST_CB = 'back_to_list'
BACK_TO_LIST_TEXT = ''

ADD_CB = 'add'
LIST_CB = 'list'
REMOVE_CB = 'remove'
HELP_CB = 'help'
REMOVE_CHECKED_CB = 'remove_checked'
REMOVE_ALL_CB = 'remove_all'

ADD_PRIRORITY_CB = 'priority_'
STAR_CB = 'star_'
ITEM_CB = 'item_'
CHECKED_CB = 'checked_'
NOTCHECKED_CB = 'notchecked_'

REMOVE_CHECKED_TEXT = 'Удалить выделенное'
REMOVE_ALL_TEXT = 'Удалить все'

MENU = 'Меню'

GO_WEB = '🌐'

HTTP = 'http'

ADD_PRIRORITY_TEXT = '❕'
STAR_TEXT = '⭐️'
ADD_TEXT = 'Добавляем-с'
LIST_TEXT = 'Список покупок'
REMOVE_TEXT = 'Нажмите на то, что хотите удалить'
# HELP_TEXT = '''
# ·Чтобы добавить что-то, напишите сообщение в виде:
# '<наименование 1> <URL 1>, <наименование 2> <URL 2>' (URL необязателен);
# Или очередной товар в новом сообщении;
# ·Чтобы завершить добавление, нажмите 'Назад';
# ·Чтобы удалить что-то, выберите это в списке пункта 'Удалить', затем нажмите 'Удалить отмеченное';
# ·Чтобы удалить все сразу, нажмите 'Удалить все' в пункте 'Удалить';
# ·Чтобы поменять приоритет закупки, нажмите на ее название в общем списке.
# '''
HELP_TEXT = '''
- Добавление - напишите сообщение в виде:
<имя 1> <URL 1>, <имя 2> <URL 2>, ...
Можете также добавлять товары несколькими сообщениями. \
Чтобы завершить добавление, нажмите "Назад"
- Удаление - отметьте товары, которые хотите удалить,\
затем нажмите "Удалить выделенное" или нажмите "Удалить все", чтобы удалить все
- Чтобы поменять приоритет товара или добавить его в избранное,\
нажмите на товар в списке покупок
'''

EMOJIS = [
    '👍', '❤', '🔥', '🥰', '👏',
    '😁', '🤔', '🤯', '😱', '🎉',
    '🤩', '🤮', '💩', '🙏', '👌',
    '🤡', '🥱', '🥴', '😍', '🌚',
    '🌭', '💯', '🤣', '🍌', '💔',
    '🤨', '😐', '🍓', '🍾', '🖕',
    '😈', '😴', '😭', '🤓', '👀',
    '🙈', '😇', '😨', '🤝', '✍',
    '🤗', '🫡', '🤪', '🗿', '🆒',
    '😘', '💊', '🙊', '😎', '😡',
]
